BlackIoT/Firmware_Polverine_Arduino/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
menu.DisplayModel=Display Model


polverine.name=Polverine

polverine.bootloader.tool=esp32:esptool_py
polverine.bootloader.tool.default=esp32:esptool_py

polverine.upload.tool=esp32:esptool_py
polverine.upload.tool.default=esp32:esptool_py
polverine.upload.tool.network=esp32:esp_ota

polverine.upload.maximum_size=1310720
polverine.upload.maximum_data_size=327680
polverine.upload.flags=
polverine.upload.extra_flags=
polverine.upload.use_1200bps_touch=false
polverine.upload.wait_for_upload_port=false

polverine.serial.disableDTR=false
polverine.serial.disableRTS=false

polverine.build.tarch=xtensa
polverine.build.bootloader_addr=0x0
polverine.build.target=esp32s3
polverine.build.mcu=esp32s3
polverine.build.core=esp32:esp32
polverine.build.variant=polverine
polverine.build.board=POLVERINE

polverine.build.usb_mode=1
polverine.build.cdc_on_boot=0
polverine.build.msc_on_boot=0
polverine.build.dfu_on_boot=0
polverine.build.f_cpu=240000000L
polverine.build.flash_size=8MB
polverine.build.flash_freq=80m
polverine.build.flash_mode=qio
polverine.build.boot=qio
polverine.build.boot_freq=80m
polverine.build.partitions=default_8MB
polverine.build.defines=
polverine.build.loop_core=
polverine.build.event_core=
polverine.build.psram_type=qspi
polverine.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
polverine.menu.JTAGAdapter.default=Disabled
polverine.menu.JTAGAdapter.default.build.copy_jtag_files=0
polverine.menu.JTAGAdapter.builtin=Integrated USB JTAG
polverine.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
polverine.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
polverine.menu.JTAGAdapter.external=FTDI Adapter
polverine.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
polverine.menu.JTAGAdapter.external.build.copy_jtag_files=1
polverine.menu.JTAGAdapter.bridge=POLVERINE USB Bridge
polverine.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
polverine.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

polverine.menu.FlashMode.qio=QIO 80MHz
polverine.menu.FlashMode.qio.build.flash_mode=dio
polverine.menu.FlashMode.qio.build.boot=qio
polverine.menu.FlashMode.qio.build.boot_freq=80m
polverine.menu.FlashMode.qio.build.flash_freq=80m
polverine.menu.FlashMode.qio120=QIO 120MHz
polverine.menu.FlashMode.qio120.build.flash_mode=dio
polverine.menu.FlashMode.qio120.build.boot=qio
polverine.menu.FlashMode.qio120.build.boot_freq=120m
polverine.menu.FlashMode.qio120.build.flash_freq=80m

polverine.menu.LoopCore.1=Core 1
polverine.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
polverine.menu.LoopCore.0=Core 0
polverine.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

polverine.menu.EventsCore.1=Core 1
polverine.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
polverine.menu.EventsCore.0=Core 0
polverine.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

polverine.menu.USBMode.hwcdc=Hardware CDC and JTAG
polverine.menu.USBMode.hwcdc.build.usb_mode=1
polverine.menu.USBMode.default=USB-OTG
polverine.menu.USBMode.default.build.usb_mode=0

polverine.menu.CDCOnBoot.default=Disabled
polverine.menu.CDCOnBoot.default.build.cdc_on_boot=0
polverine.menu.CDCOnBoot.cdc=Enabled
polverine.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

polverine.menu.MSCOnBoot.default=Disabled
polverine.menu.MSCOnBoot.default.build.msc_on_boot=0
polverine.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
polverine.menu.MSCOnBoot.msc.build.msc_on_boot=1

polverine.menu.DFUOnBoot.default=Disabled
polverine.menu.DFUOnBoot.default.build.dfu_on_boot=0
polverine.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
polverine.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

polverine.menu.UploadMode.default=UART0 / Hardware CDC
polverine.menu.UploadMode.default.upload.use_1200bps_touch=false
polverine.menu.UploadMode.default.upload.wait_for_upload_port=false
polverine.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
polverine.menu.UploadMode.cdc.upload.use_1200bps_touch=true
polverine.menu.UploadMode.cdc.upload.wait_for_upload_port=true

polverine.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
polverine.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
polverine.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
polverine.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
polverine.menu.PartitionScheme.default.build.partitions=default
polverine.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
polverine.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
polverine.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
polverine.menu.PartitionScheme.minimal.build.partitions=minimal
polverine.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
polverine.menu.PartitionScheme.no_fs.build.partitions=no_fs
polverine.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
polverine.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
polverine.menu.PartitionScheme.no_ota.build.partitions=no_ota
polverine.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
polverine.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
polverine.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
polverine.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
polverine.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
polverine.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
polverine.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
polverine.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
polverine.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
polverine.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
polverine.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
polverine.menu.PartitionScheme.huge_app.build.partitions=huge_app
polverine.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
polverine.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
polverine.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
polverine.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
polverine.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
polverine.menu.PartitionScheme.fatflash.build.partitions=ffat
polverine.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
polverine.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
polverine.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
polverine.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
polverine.menu.PartitionScheme.rainmaker=RainMaker 4MB
polverine.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
polverine.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
polverine.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
polverine.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
polverine.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
polverine.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
polverine.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
polverine.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
polverine.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
polverine.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
polverine.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
polverine.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
polverine.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
polverine.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
polverine.menu.PartitionScheme.custom=Custom
polverine.menu.PartitionScheme.custom.build.partitions=
polverine.menu.PartitionScheme.custom.upload.maximum_size=16777216

polverine.menu.CPUFreq.240=240MHz (WiFi)
polverine.menu.CPUFreq.240.build.f_cpu=240000000L
polverine.menu.CPUFreq.160=160MHz (WiFi)
polverine.menu.CPUFreq.160.build.f_cpu=160000000L
polverine.menu.CPUFreq.80=80MHz (WiFi)
polverine.menu.CPUFreq.80.build.f_cpu=80000000L
polverine.menu.CPUFreq.40=40MHz
polverine.menu.CPUFreq.40.build.f_cpu=40000000L
polverine.menu.CPUFreq.20=20MHz
polverine.menu.CPUFreq.20.build.f_cpu=20000000L
polverine.menu.CPUFreq.10=10MHz
polverine.menu.CPUFreq.10.build.f_cpu=10000000L

polverine.menu.UploadSpeed.921600=921600
polverine.menu.UploadSpeed.921600.upload.speed=921600
polverine.menu.UploadSpeed.115200=115200
polverine.menu.UploadSpeed.115200.upload.speed=115200
polverine.menu.UploadSpeed.256000.windows=256000
polverine.menu.UploadSpeed.256000.upload.speed=256000
polverine.menu.UploadSpeed.230400.windows.upload.speed=256000
polverine.menu.UploadSpeed.230400=230400
polverine.menu.UploadSpeed.230400.upload.speed=230400
polverine.menu.UploadSpeed.460800.linux=460800
polverine.menu.UploadSpeed.460800.macosx=460800
polverine.menu.UploadSpeed.460800.upload.speed=460800
polverine.menu.UploadSpeed.512000.windows=512000
polverine.menu.UploadSpeed.512000.upload.speed=512000

polverine.menu.DebugLevel.none=None
polverine.menu.DebugLevel.none.build.code_debug=0
polverine.menu.DebugLevel.error=Error
polverine.menu.DebugLevel.error.build.code_debug=1
polverine.menu.DebugLevel.warn=Warn
polverine.menu.DebugLevel.warn.build.code_debug=2
polverine.menu.DebugLevel.info=Info
polverine.menu.DebugLevel.info.build.code_debug=3
polverine.menu.DebugLevel.debug=Debug
polverine.menu.DebugLevel.debug.build.code_debug=4
polverine.menu.DebugLevel.verbose=Verbose
polverine.menu.DebugLevel.verbose.build.code_debug=5

polverine.menu.EraseFlash.none=Disabled
polverine.menu.EraseFlash.none.upload.erase_cmd=
polverine.menu.EraseFlash.all=Enabled
polverine.menu.EraseFlash.all.upload.erase_cmd=-e

polverine.menu.ZigbeeMode.default=Disabled
polverine.menu.ZigbeeMode.default.build.zigbee_mode=
polverine.menu.ZigbeeMode.default.build.zigbee_libs=
polverine.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
polverine.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
polverine.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################
